Sirokujira/llvm/lib/Target/RX600/AsmParser/RX600AsmParser.cpp
  bool isToken() const override { return Kind == Token; }
  bool isReg() const override { return Kind == Register; }
  bool isImm() const override { return Kind == Immediate; }
  bool isMem() const override { return false; }

  bool evaluateConstantImm(int64_t &Imm, RX600MCExpr::VariantKind &VK) const {
    const MCExpr *Val = getImm();
    bool Ret = false;
    if (auto *RE = dyn_cast<RX600MCExpr>(Val)) {
      Ret = RE->evaluateAsConstant(Imm);
      VK = RE->getKind();
    } else if (auto CE = dyn_cast<MCConstantExpr>(Val)) {
      Ret = true;
      VK = RX600MCExpr::VK_RX600_None;
      Imm = CE->getValue();
    }
    return Ret;
  }

  // True if operand is a symbol with no modifiers, or a constant with no
  // modifiers and isShiftedInt<N-1, 1>(Op).
  template <int N> bool isBareSimmNLsb0() const {
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    if (!isImm())
      return false;
    bool IsConstantImm = evaluateConstantImm(Imm, VK);
    bool IsValid;
    if (!IsConstantImm)
      IsValid = RX600AsmParser::classifySymbolRef(getImm(), VK, Imm);
    else
      IsValid = isShiftedInt<N - 1, 1>(Imm);
    return IsValid && VK == RX600MCExpr::VK_RX600_None;
  }

  // Predicate methods for AsmOperands defined in RX600InstrInfo.td

  bool isBareSymbol() const {
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    // Must be of 'immediate' type but not a constant.
    if (!isImm() || evaluateConstantImm(Imm, VK))
      return false;
    return RX600AsmParser::classifySymbolRef(getImm(), VK, Imm) &&
           VK == RX600MCExpr::VK_RX600_None;
  }

  /// Return true if the operand is a valid for the fence instruction e.g.
  /// ('iorw').
  bool isFenceArg() const {
    if (!isImm())
      return false;
    const MCExpr *Val = getImm();
    auto *SVal = dyn_cast<MCSymbolRefExpr>(Val);
    if (!SVal || SVal->getKind() != MCSymbolRefExpr::VK_None)
      return false;

    StringRef Str = SVal->getSymbol().getName();
    // Letters must be unique, taken from 'iorw', and in ascending order. This
    // holds as long as each individual character is one of 'iorw' and is
    // greater than the previous character.
    char Prev = '\0';
    for (char c : Str) {
      if (c != 'i' && c != 'o' && c != 'r' && c != 'w')
        return false;
      if (c <= Prev)
        return false;
      Prev = c;
    }
    return true;
  }

  /// Return true if the operand is a valid floating point rounding mode.
  bool isFRMArg() const {
    if (!isImm())
      return false;
    const MCExpr *Val = getImm();
    auto *SVal = dyn_cast<MCSymbolRefExpr>(Val);
    if (!SVal || SVal->getKind() != MCSymbolRefExpr::VK_None)
      return false;

    StringRef Str = SVal->getSymbol().getName();

    return RX600FPRndMode::stringToRoundingMode(Str) != RX600FPRndMode::Invalid;
  }

  bool isImmXLen() const {
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    if (!isImm())
      return false;
    bool IsConstantImm = evaluateConstantImm(Imm, VK);
    // Given only Imm, ensuring that the actually specified constant is either
    // a signed or unsigned 64-bit number is unfortunately impossible.
    bool IsInRange = isRX600() ? true : isInt<32>(Imm) || isUInt<32>(Imm);
    return IsConstantImm && IsInRange && VK == RX600MCExpr::VK_RX600_None;
  }

  bool isUImmLog2XLen() const {
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    if (!isImm())
      return false;
    if (!evaluateConstantImm(Imm, VK) || VK != RX600MCExpr::VK_RX600_None)
      return false;
    return (isRX600() && isUInt<6>(Imm)) || isUInt<5>(Imm);
  }

  bool isUImmLog2XLenNonZero() const {
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    if (!isImm())
      return false;
    if (!evaluateConstantImm(Imm, VK) || VK != RX600MCExpr::VK_RX600_None)
      return false;
    if (Imm == 0)
      return false;
    return (isRX600() && isUInt<6>(Imm)) || isUInt<5>(Imm);
  }

  bool isUImm5() const {
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    if (!isImm())
      return false;
    bool IsConstantImm = evaluateConstantImm(Imm, VK);
    return IsConstantImm && isUInt<5>(Imm) && VK == RX600MCExpr::VK_RX600_None;
  }

  bool isUImm5NonZero() const {
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    if (!isImm())
      return false;
    bool IsConstantImm = evaluateConstantImm(Imm, VK);
    return IsConstantImm && isUInt<5>(Imm) && (Imm != 0) &&
           VK == RX600MCExpr::VK_RX600_None;
  }

  bool isSImm6() const {
    if (!isImm())
      return false;
    RX600MCExpr::VariantKind VK;
    int64_t Imm;
    bool IsValid;
    bool IsConstantImm = evaluateConstantImm(Imm, VK);
    if (!IsConstantImm)
      IsValid = RX600AsmParser::classifySymbolRef(getImm(), VK, Imm);
    else
      IsValid = isInt<6>(Imm);
    return IsValid &&
           (VK == RX600MCExpr::VK_RX600_None || VK == RX600MCExpr::VK_RX600_LO);
  }

  bool isSImm6NonZero() const {
    if (!isImm())
      return false;
    RX600MCExpr::VariantKind VK;
    int64_t Imm;
    bool IsValid;
    bool IsConstantImm = evaluateConstantImm(Imm, VK);
    if (!IsConstantImm)
      IsValid = RX600AsmParser::classifySymbolRef(getImm(), VK, Imm);
    else
      IsValid = ((Imm != 0) && isInt<6>(Imm));
    return IsValid &&
           (VK == RX600MCExpr::VK_RX600_None || VK == RX600MCExpr::VK_RX600_LO);
  }

  bool isCLUIImm() const {
    if (!isImm())
      return false;
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    bool IsConstantImm = evaluateConstantImm(Imm, VK);
    return IsConstantImm && (Imm != 0) &&
           (isUInt<5>(Imm) || (Imm >= 0xfffe0 && Imm <= 0xfffff)) &&
            VK == RX600MCExpr::VK_RX600_None;
  }

  bool isUImm7Lsb00() const {
    if (!isImm())
      return false;
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    bool IsConstantImm = evaluateConstantImm(Imm, VK);
    return IsConstantImm && isShiftedUInt<5, 2>(Imm) &&
           VK == RX600MCExpr::VK_RX600_None;
  }

  bool isUImm8Lsb00() const {
    if (!isImm())
      return false;
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    bool IsConstantImm = evaluateConstantImm(Imm, VK);
    return IsConstantImm && isShiftedUInt<6, 2>(Imm) &&
           VK == RX600MCExpr::VK_RX600_None;
  }

  bool isUImm8Lsb000() const {
    if (!isImm())
      return false;
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    bool IsConstantImm = evaluateConstantImm(Imm, VK);
    return IsConstantImm && isShiftedUInt<5, 3>(Imm) &&
           VK == RX600MCExpr::VK_RX600_None;
  }

  bool isSImm9Lsb0() const { return isBareSimmNLsb0<9>(); }

  bool isUImm9Lsb000() const {
    if (!isImm())
      return false;
    int64_t Imm;
    RX600MCExpr::VariantKind VK;
    bool IsConstantImm = evaluateConstantImm(Imm, VK);
    return IsConstantImm && isShiftedUInt<6, 3>(Imm) &&
           VK == RX600MCExpr::VK_RX600_None;
  }

